src/rhoCentralFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       19800;
    }
    sym
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          60;
        startFace       19900;
    }
    wedge
    {
        type            patch;
        nFaces          40;
        startFace       19960;
    }
    top
    {
        type            patch;
        nFaces          100;
        startFace       20000;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       20100;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          10000;
        startFace       30100;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       40100;
    }
)

// ************************************************************************* //
